<?php

namespace App\Services;

class MyService
{
    /**
     * Create a new class instance.
     */
    // public function __construct()
    // {
    //     //
    // }
    protected $title = [
        1 => "ประวัติความเป็นมา",
        2 => "วิสัยทัศน์",
        3 => "ข้อมูลสภาพทั่วไป",
        4 => "บริการขั้นพื้นฐาน",
        5 => "ผู้นำชุมชน",
        6 => "รายละเอียดชุมชน",
        7 => "ผลิตภัณฑ์ชุมชน",
        8 => "สถานที่สำคัญ",
        9 => "โครงสร้างองค์กร",
        10 => "คณะผู้บริหาร",
        11 => "สภาชิกสภา",
        12 => "หัวหน้าส่วนราชการ",
        13 => "สำนักปลัดเทศบาล",
        14 => "กองคลัง",
        15 => "กองช่าง",
        16 => "กองการศึกษา",
        17 => "หน่วยตรวจสอบภายใน",
        18 => "รายงานกองคลัง",
        19 => "รายงานผลการดำเนินงาน",
        20 => "รายงานการจัดซื้อจัดจ้างหรือการจัดหาพัสดุ",
        21 => "ข้อมูลเชิงสถิติ",
        22 => "การบริหารและพัฒนาทรัพยากรบุคล",
        23 => "มาตรการส่งเสริมความโปร่งใสและป้องกันการทุจริต",
        24 => "ประมวลจริยธรรม",
        25 => "นโยบายไม่รับของขวัญ",
        26 => "การเปิดโอกาสให้เกิดการมีส่วนร่วม",
        27 => "เทศบาลตำบล",
        28 => "สำนักปลัดเทศบาล",
        29 => "กองคลัง",
        30 => "กองช่าง",
        31 => "กองการศึกษา",
        32 => "หน่วยตรวจสอบภายใน",
        33 => "แผนพัฒนาท้องถิ่น",
        34 => "กฎหมายที่เกี่ยวข้อง",
        35 => "รับเเจ้งเรื่องราวร้องเรียนร้องทุกข์",
        36 => "รับเเจ้งเรื่องราวร้องเรียนการทุจริต",
        37 => "รายงานผลสำรวจความพึงพอใจในการให้บริการ",
        38 => "คู่มืออื่นๆ",
        39 => "เอกสารดาวน์โหลด",
        40 => "ยื่นคำร้องออนไลน์ E-service",
        41 => "คำถามที่พบบ่อย",
        42 => "ประกาศจัดซื้อจัดจ้าง",
        43 => "ผลประกาศจัดซื้อจัดจ้าง",
        44 => "ประกาศราคากลาง",
        45 => "แบนเนอร์แนะนำ",
        46 => "POP UP",
        47 => "ภาพสไลด์",
        48 => "วิดีทัศน์",
        49 => "ป้ายประกาศ",
        50 => "สารจากนายก",
        51 => "เจตจำนงสุจริตของผู้บริหาร",
        52 => "กิจกรรม",
        53 => "ข่าวประชาสัมพันธ์",
        54 => "แบบสำรวจความคิดเห็น",
        55 => "ติดต่อ",
        56 => "กระดานสนทนา",
        57 => "การประเมินคุณธรรมและความโปร่งใส (ITA)",
        58 => "การประเมินประสิทธิภาพภายใน (LPA)",
        59 => "การจัดการองค์ความรู้ (KM)",
        60 => "รายงานกิจการสภา",
        61 => "เอกสารเผยแพร่",
        62 => "ระบบสารสนเทศ",
        63 => "ศูนย์พัฒนาเด็กเล็ก",
        64 => "กองทุนหลักประกันสุขภาพ (สปสช.)",
        65 => "แนะนำร้านอาหาร",
        66 => "แบนเนอร์ภายใน",
        67 => "แบนเนอร์ภายนอก",
        68 => "งานบริการและอื่นๆ",
        69 => "ปฏิทินกิจกรรม",
        70 => "ข้อมูลการแสดงความคิดเห็น",
       

    ];

    public function getDataByKey(string $key)
    {
        
        if (isset($this->title[$key])) {
            
            return $this->title[$key];
        }

        return null;
    }


    public function getAllData()
    {
        return $this->title;
    }
}
