<?php

namespace App\Services;

class MyService
{
    /**
     * Create a new class instance.
     */
    // public function __construct()
    // {
    //     //
    // }
    protected $title = [
        1 => "ประวัติความเป็นมา",
        2 => "วิสัยทัศน์",
        3 => "ข้อมูลสภาพทั่วไป",
        4 => "บริการขั้นพื้นฐาน",
        5 => "ผู้นำชุมชน",
        6 => "รายละเอียดชุมชน",
        7 => "ผลิตภัณฑ์ชุมชน",
        8 => "สถานที่สำคัญ",
        9 => "แผนผังโครงสร้างองค์กร",
        10 => "คณะผู้บริหาร",
        11 => "สภาชิกสภา",
        12 => "ผู้บริหารส่วนราชการ",
        13 => "สำนักปลัด",
        14 => "กองยุทธศาสตร์",
        15 => "กองคลัง",
        16 => "กองช่าง",
        17 => "กองสาธารณสุขและสิ่งแวดล้อม",
        18 => "กองการศึกษา",
        19 => "กองสวัสดิการสังคม",
        20 => "หน่วยตรวจสอบภายใน",
        18 => "รายงานกองคลัง",
        19 => "รายงานผลการดำเนินงาน",
        20 => "รายงานการจัดซื้อจัดจ้างหรือการจัดหาพัสดุ",
        21 => "ผลงานองค์กร",
        22 => "รายงานทางการเงิน",
        23 => "รายงานผลการดำเนินงาน",
        24 => "รายงานการจัดซื้อจัดจ้างหรือการจัดหาพัสดุ",
        25 => "ข้อมูลเชิงสถิติ",
        26 => "การบริหารและพัฒนาทรัพยากรบุคล",
        27 => "มาตรการส่งเสริมความโปร่งใสและป้องกันการทุจริต",
        28 => "ประมวลจริยธรรมและการขับเคลื่อนจริยธรรม",
        29 => "เทศบาลตำบล",
        30 => "สำนักปลัด",
        31 => "กองยุทธศาสตร์",
        32 => "กองคลัง",
        33 => "กองช่าง",
        34 => "กองสาธารณสุขและสิ่งแวดล้อม",
        35 => "กองการศึกษา",
        36 => "กองสวัสดิการสังคม",
        37 => "หน่วยตรวจสอบภายใน",
        38 => "แผนงานและงบประมาณ",
        39 => "เทศบัญญัติและคำสั่ง",
        40 => "กฎหมายที่เกี่ยวข้อง",
        41 => "รับเเจ้งเรื่องราวร้องเรียนร้องทุกข์",
        42 => "รับเเจ้งเรื่องราวร้องเรียนการทุจริตและประพฤติมิชอบ",
        43 => "แบบสอบถามความพึงพอใจ",
        44 => "รายงานผลสำรวจความพึงพอใจ",
        45 => "คู่มือการทำงานของหน่วยงาน",
        46 => "ดาวน์โหลดแบบฟอร์ม",
        47 => "ยื่นคำร้องออนไลน์ E-service",
        48 => "ประกาศจัดซื้อจัดจ้าง",
        49 => "ผลประกาศจัดซื้อจัดจ้าง",
        50 => "รายงานผลการจัดซื้อจัดจ้าง",
        51 => "กิจกรรม",
        52 => "ข่าวประชาสัมพันธ์",
        53 => "แบนเนอร์แนะนำ",
        54 => "แบนเนอร์ภายนอก",
        55 => "แบนเนอร์ภายใน",
        56 => "รางวัลแห่งความภูมิใจ",
        57 => "ปฏิทินกิจกรรม",
        58 => "การประเมินคุณธรรมและความโปร่งใส (ITA)",
        59 => "การประเมินประสิทธิภาพภายใน (LPA)",
        60 => "การจัดการองค์ความรู้ (KM)",
        61 => "ศูนย์ข้อมูลข่าสาร",
        62 => "ข้อมูลอาเซียน",
        63 => "ประชาสัมพันธ์การเลือกตั้ง",
        64 => "รายงานกิจการสภา",
        65 => "แนะนำสถานที่ท่องเที่ยว",
        66 => "แนะนำร้านอาหาร",
        67 => "POP UP",
        68 => "ภาพสไลด์",
        69 => "วิดีทัศน์",
        70 => "ป้ายประกาศ",
        71 => "สารจากนายก",
        72 => "เจตจำนงสุจริตของผู้บริหาร",
        73 => "ข้อมูลการแสดงความคิดเห็น (Vote)",
        74 => "ติดต่อ",
        75 => "กระดานสนทนา",
        76 => "แผนพัฒนาเศรษฐกิจและสังคมแห่งชาติ",
       

    ];

    public function getDataByKey(string $key)
    {
        
        if (isset($this->title[$key])) {
            
            return $this->title[$key];
        }

        return null;
    }


    public function getAllData()
    {
        return $this->title;
    }
}
